{
  "workExperience": [
    {
      "company": "Cred",
      "icon": "cred",
      "startDate": "May, 2022",
      "designation": "Frontend Engineer",
      "location": "Bengaluru, India"
    },
    {
      "company": "Disney+ Hotstar",
      "icon": "hotstar",
      "startDate": "February, 2022",
      "endDate": "May, 2022",
      "isPartTime": true,
      "designation": "SDE-2, Frontend",
      "location": "Gurgaon, India",
      "responsibilities": [
        "Implemented Chrome Cast Receiver application for Hotstar using React and CAF framework."
      ]
    },
    {
      "company": "Paytm Payments Bank",
      "icon": "ppbl",
      "startDate": "February, 2021",
      "endDate": "February, 2022",
      "designation": "SE, Frontend",
      "location": "Noida, India",
      "responsibilities": [
        "Design and develop new features/requirements by translating given Wire-frames into Web Components that meets markup standards, cross-browser compatibility, usability principles and accessibility.",
        "Develop reusable and modular UI components utilizing Preact and Storybook, define accessibility and governance and rollout the components across the Paytm Web Components library.",
        "Enhanced overall web application performance by optimizing the critical rendering path, reducing page load time and improving performance metrics such as FCP, FMP and TTI etc from 82% to 90%.",
        "Handling the interface layer (Backend For Frontend) for integrating/tailoring the distributed multi microservice architecture with the web-application and achieving a combination of static side generation and server side rendering.",
        "Improved web application security by composing middleware’s to prevent various attacks such as CSRF, XSS, CSP and Click-Jacking etc which diminished the attacks from 7% to 4.2%.",
        "Collaborate with team to design, develop, test and refine expected deliverables that meet the objectives and quality standards across multiple releases."
      ]
    },
    {
      "company": "GlobalLogic",
      "icon": "gl",
      "startDate": "October, 2019",
      "endDate": "January, 2021",
      "designation": "ASE, Frontend",
      "location": "Noida, India",
      "responsibilities": [
        "Designed and developed the Web Application where user can compare and purchase insurance plans for their pets for a pet insurance company, PetPlan.",
        "Ported the frontend of content management system application from JSP pages in Spring framework to React Web Components in MVC architecture for a content engagement platform provider, Naviga which increased the user engagement by 85%.",
        "Developed the coach and student web panel for an internal product, Career Path which helps the employees to track their career progression and schedule meetings with career coaches.",
        "Assisted senior developers in performing code reviews and implementing improvement plans.",
        "Acclimated to new technologies and situations with the vision of providing best customer experience."
      ]
    }
  ]
}
